//  Tours info

const tours = [
    {
        id: 1,
        img: "../src/card-1.jpeg",
        title: "Лион и Перуж, знакомство с регионом",
        place: "Лион – Франция",
        time: "4-6 часов",
        price: 50,
        slider: ['../src/1slider-1.jpeg', '../src/1slider-2.jpeg', '../src/1slider-3.jpeg', ],
        body: `Средневековая деревушка Перуж подарит вам массу приятных впечатлений своей кокетливостью и выразительным очарованием старины. Прогулка здесь — это волшебное путешествие в исторический фильм, где при желании вам также выпадет роль.<br> <br> 
        Мимо ремесленных лавок, мощенных крупным булыжником фасадов домов, часовен, руин замка, таверен вы попадаете на центральную рыночную площадь. Всё живет естественной жизнью и процветает, как это было в далеком прошлом. Короли сменялись, передвигались границы и названия государств, а сними городов, здесь же все шло своим руслом. 
        Местные ремесленники продавали или обменивали свои товары с теми, кто приходил в их город. Строгая городская хартия четко прописана в истории маленькой и гордой своей независимостью деревеньки Перуж.<br> <br> 
        Сегодня это скорее цветущий исторический центр, где каждому камню своё место. Сюда приходят изучать историю страны, костюма, быта, уклада жизни на пороге эпохи Возрождения. Здесь же фестивали, музыкальные вечера и костюмированные балы. Иллюстрация европейской жизни людей позднего средневековья. Внешне городок остался в целом таким, каким был 600 лет назад. 
        Всё те же крепостные стены, дома из булыжников, взятых неподалеку, вымощенные извилистые улочки, со сточной канавой посередине. Каждый уголок таит в себе легенду. Костры инквизиции, вспышки чумы, крикливый рынок на центральной площади, атаки соседей-захватчиков, разбойники с большой дороги, и вместе с этим здесь сохранился образ романтичной прекрасной Дамы, запертой строгим отцом в башне замка. Вокруг замка разбит средневековый сад, символичный, духовный и просто необходимый в мире, где не знали медицины.`,
    },
    {
        id: 2,
        img: "../src/card-2.jpeg",
        title: "Лион от Античности через Темные века к Возрождению",
        place: "Лион – Франция",
        time: "4-6 часов",
        price: 50,
        slider: ['../src/2slider-1.jpeg', '../src/2slider-2.jpeg', '../src/2slider-3.jpeg', ],
        body: `Экскурсия в Лионе охватывает весь исторический и пешеxодный центр. Это прогулка в вашем ритме по Старой части города — музей под открытым небом, это же и памятник Юнеско. <br> <br> 
        История города начинается здесь же на холме еще до появления Христианства. Античные памятники на склонах холмов раскрывают перед нами свои амфитеатры и повествуют о достижениях античной цивилизации. Упадок империи в V веке и утеря размеренного уклада жизни в городе предопределили его переустройство и перерождение. <br> <br> 
        Столичный и крупный город в Галлии, в Средневековье получает новое имя и становится важным христианским центром. В эпоху Возрождения складывается Старый город, богатый архитектурный ансамбль. Здесь нас ждут удивительные находки лионского фонклёра, прогулки по старинным улочкам и визит готического собора Святого Иоанна.<br> <br> 
        Наиболее нашумевший в истории Лиона был период шелкового производства, некогда он был шелковой столицей Францией, теперь у него мировая гастрономическая репутация. Во время экскурсии вы узнаете об этом подробней и познакомитесь с ярчайшими представителями лионской жизни в прошлом и в настоящем.<br> <br> 
        Панорамный вид на город открывается на холм Фурвьер, здесь же увлекательный визит Базилики Девы Марии. Подъем на холм на фунекулёре или пешком.<br> <br> 
        Сквозь пару тысяч лет истории, быт и нравы изменились в многоликом Лионе, познав взлеты и падения, город сохранил свои памятники и ярчайшую историю. Он продолжает подпитывать дух спиритизма и мистики, появившийся здесь на заре цивилизаций. Последние находки тайных подземных лабиринтов служат сюжетом для книг и исследований.<br> <br> 
        Лион очарует вас в любой сезон и при любой погоде.<br> 
        В городе гурманов всегда можно организовать дегустацию местных лакомств, местные блюда составляют особый шарм городу и закрепляют репутацию французской гастрономии.`,
    },
    {
        id: 3,
        img: "../src/card-3.jpeg",
        title: "Из Лиона через Божоле в Бургундию",
        place: "Лион → Вильфранш-сюр-Сон → Макон → Лион",
        time: "7 часов",
        price: 40,
        slider: ['../src/3slider-1.jpeg', '../src/3slider-2.jpeg', '../src/3slider-3.jpeg', ],
        body: `Божоле расположено всего в получасе езды на автомобиле из Лиона, что очень располагает для визита замков и прогулки с дегустацией. Можно провести первую половину дня в Божоле, следующим же этапом станет Южная Бургундия (в часе езды от Лиона). Здесь к вашему вниманию также старинные замки, крепости, аббатство Клюни и средневековые часовни, визиты с дегустациями в престижные винные дома Бургундии.<br> <br> 

        На всем протяжении региона Божоле путешественника не оставляет ощущение путешествия во времени. Невероятной красоты холмистые пейзажи, вьющиеся дороги среди виноградников, пригнездившиеся замки и уютные деревеньки, куда я вас приглашаю для визитов и дегустаций.<br> <br> 
        
        Попав в Божоле первое, что бросается в глаза, так это золотистый известняк, из которого выстроены дома, соборы, крепости, замки, часовни… Гармоничное сочетание этот уникального цвета камня с пейзажем отражается в фольклерной культуре этого винного региона. Второй общий признак — это дома виноделов. Нередко погреб и винодельня это часть жилого дома в окружении собственных виноградников. Как известно, лучшие вина производятся с виноградников склонов холмов. <br> <br> 
        И это также зает особый шарм стране Божоле, где за одним холмом прячется другой, одно крю — марочное вино отличается от другого, хотя располагаются в соседних деревушка, дающие имена этим крю.
        
        В программу о Божоле входят пешие прогулки по деревням, входящих в почётный список самых красивых мест Франции, дегустации вин и знакомство с историей и культурой региона. `,
    },
    {
        id: 4,
        img: "../src/card-4.jpeg",
        title: "Пейзажный и самобытный край Божоле",
        place: "Лион → Вильфранш-сюр-Сон → Лион",
        time: "4-8 часов",
        price: 50,
        slider: ['../src/4slider-1.jpeg', '../src/4slider-2.jpeg', '../src/4slider-3.jpeg', ],
        body: `Маршрут включает визиты в престижные винные дома, посещение места производства, спуск в погреба, личное знакомство с виноделом, прогулка по виноградникам. Стоимость визита и дегустаций — от 10 до 20 EUR за 1 человека в зависимости от категории и количества вин.<br> <br> 

        На всем протяжении региона Божоле путешественника не оставляет ощущение путешествия во времени. Невероятной красоты холмистые пейзажи, вьющиеся дороги среди виноградников, пригнездившиеся замки и уютные деревеньки, куда я вас приглашаю для визитов и дегустаций.<br> <br> 
        
        Особенное отличие Божоле — это золотистый известняк, из которого выстроены дома, соборы, крепости, замки, часовни… Гармоничное сочетание этот уникального цвета камня с пейзажем отражается в фольклерной культуре этого винного региона. Еще одна особенность общий признак в регионе среди винных деревушек — это дома виноделов. Нередко погреб и винодельня это часть жилого дома в окружении собственных виноградников. 
        Как известно, лучшие вина производятся с виноградников, расположенных на склонах холмов. Именно холмы задают особый шарм стране Божоле, где один холм прячется другой. Одно крю — марочное вино отличается от другого, хотя располагаются в соседних деревушка, как раз и дающие имена этим крю.<br> <br> 
        
        В программу о Божоле входят пешие прогулки по деревнях, входящих в почётный список самых красивых мест Франции, дегустации вин и знакомство с историей и культурой региона. `,
    },
    {
        id: 5,
        img: "../src/card-5.jpeg",
        title: "Королевская усыпальница",
        place: "Лион → Бурк-Ан-Брес → Лион",
        time: "2-8 часов",
        price: 50,
        slider: ['../src/5slider-1.jpeg', '../src/5slider-2.jpeg', '../src/5slider-3.jpeg', ],
        body: `Изящный силуэт некрополя привлекает внимание издалека, цветная лакированная черепица завораживает взгляд. С чего бы выстроить здесь на равнине страны Бресс столь дивное строение в стиле пламенеющей готики в самом начале 16 века? Незаурядная доля выпала одной из европейских принцесс, по имени Маргарита. Всю свою насыщенную событиями жизнь просвещенной женщины эпохи Возрождения, в окружении светлейших голов своего времени, она вложила в одну строчку: Богаство не всегда приносит счастье.<br> <br> 

        Эти слова в готическом стиле вписаны в декор богато украшенной усыпальницы, в которой покоится она сама, ее муж — герцог Савойский и его мать Маргарита Савойская. Место захоронения было выбрано не случайно. Стиль архитектуры и внутреного убранства продуман до мелочей и оплачен семьей Гасбургов. В затаенном местечке Франции под защитой Альп, сохранился данный шедевр зодчества, где европейская история сошлась в одной точке, несмотря на бесконечные войны. <br> <br> 
        
        Визит усыпальницы, монастырского комплекса — ныне это музей, прогулка в саду рядом некрополем.<br> <br> 
        
        Город Бург-ан-Брес расположен в часе езды от Лиона, через лягушатники и пруды лежит живописный путь сюда и в средневековую деревню Перуж. `,
    },
    {
        id: 6,
        img: "../src/card-6.jpeg",
        title: "Мистический Лион",
        place: "Лион – Франция",
        time: "3 часа",
        price: 50,
        slider: ['../src/6slider-1.jpeg', '../src/6slider-2.jpeg', '../src/6slider-3.jpeg', ],
        body: ` Экскурсия в Лионе затронет вас своей неординарностью.<br> <br> 

        С панорамной площадки холма Фурвьер мы пройдемся по руинам античных амфитеатров, спустимся в старую часть города, что теперь является музеем под открытым небом. Архитектурный ансамбль размером в три городских квартала станет часть экскурсии с акцентом на Средневековье и Ренессанс.<br> <br> 
        
        Визит готического храма, проход по секретным улочкам, прогулка по городским площадям. Лион не раскрывает свои богатства всем праздно прогуливающимся, он доверяет искушенным.<br> <br> 
        
        Античная цивилизация уже давно пала в Лету. Жизнь в городе после разрушительных войн с варварами была налажена церковью. Ее огромное влияние закрепилось монастырскими застройками, строительством церквей и контролем за моралью общества. Уже в XI веке глава духовенства получает важный статус Примаса и тем самым утверждает господство церкви в городской жизни. 
        Несколько веков город был единой общиной духовников, пока это не стало помехой для развития коммерции и производственной жизни горожан. Новое веяние итальянских меценатов, королевская привилегия для горожан — право заниматься шелкопрядством, первые книгопечатные станки, коммерция люксовых товаров и много другое повлекли за собой коренное изменение в жизни общества.<br> <br> 
        
        В приятной и увлекательной прогулке вы последовательно и наглядно узнаете о жизни французских горожан в Лионе и в округе. Если у вас есть в запасе не только полдня, а целый день, тогда можно прокатиться до средневековой деревушки Перуж, где тема экскурсии продолжится посещением одного из сеньорских замков.`,
    },
    {
        id: 7,
        img: "../src/card-7.jpeg",
        title: "С удачным сабражем Вас, Дамы и Господа!",
        place: "Реймс → Эперне → Труа → Реймс",
        time: "1-3 дня",
        price: 40,
        slider: ['../src/7slider-1.jpeg', '../src/7slider-2.jpeg', '../src/7slider-3.jpeg', ],
        body: `Ниже вариант модели программы на несколько дней:<br> <br> 

        <strong> День 1. </strong> После завтрака в отеле или по приезду в Реймс, дорога на юг, приезд в деревеню классификации Grand CRU, останавливаемся для визита поместья и дегустации.<br> 
        В зависимости от категории вин и их количества цена за дегустацию варьируется от 19 до 99 EUR.<br> 
        На ваш выбор или по моим рекомендациям обед в ресторане или в винном поместье.<br> 
        Продолжительность каждой дегустации зависит от вашего интереса к винам и производству, в среднем визит погребов и места производства длится от часа до двух, включая дегустацию.<br> 
        Дорога до следующего пункта программы.<br> 
        Визит исторического замка и парка.<br> 
        В замке картины великих французов 18 века нарисованы прямо на стенах, интерьер этого дома служил им мастерской и ателье. Кардинал Ришелье не раз посещал этот дом, ведя шпионаж за своими врагами и союзниками, племенница Мазарини, в которую был влюблен короля Солнце, окончивала свой век в этих стенах в компании баснослова Лафонтен. <br> 
        Хозяин исторического замка лично встречает дорогих гостей и проводит экскурсии по своему дому-музею. По окончанию — сабраж любимого Шампанского королей.<br> 
        Дегустация нескольких видов вин Шампанского.<br> 
        Ночь в Шампани. <br> <br> 
        
        <strong> День 2. </strong>
        Шампань — дегустации и визиты домов Шампанского с мировой известностью, расположенные в Реймсе, по окончанию экскурсия в центре города.<br> 
        Реймс Винный дом Посещение глубоких погребов, где созревает Шампанское. Краткое описание одного из визитов. Дом известный на весь мир уже несколько столетий. В его прошлом владелец управлял и спонсировал госпитали и монастыри. Остатки одного из монастырских зданий были выкуплены вместе с погребами, куда и приглашают для экскурсий и объяснений всех тонкостей винопроизводства в регионе. Также история гласит, что эти подземные туннели, где сегодня вызревает Шампанское соединяются с теми, что пронизывают насквозь всю столицу Шампани.<br> 
        Экскурсия 1,5 часа и дегустация.<br> 
        Обед и после продолжение дегустаций в другом винном доме Реймса. История Великого вина и Великих людей. Роль и позиция вин на мировом рынке на протяжении столетий.<br> 
        Визит собора Девы Марии в Реймсе.<br> 
        Благородство форм и величие собора впечатляет, на его фасадах в лицах оживает история Франции и Христианства. Более двух тысяч фигур, некоторые из них шедевры средневековой скульптуры. Одна из них Улыбающийся ангел стала символом столицы Шампани.<br> 
        Экскурсия 1,5 ч дополнительно посещение музея Тo, история коронации в Реймсе.<br> 
        Свободное время в Реймсе.<br> 
        Очередность визитов и часовая программа выстраивается индивидуально по вашим датам, с учетом ваших пожеланий.<br> <br> 
        
        <strong> День 3. </strong>
        
        Дорога в Труа и по завитой в серпантин дороге Великих вин Франции, не пропускаем гастрономические остановки.<br> 
        В одной из деревушек остановимся на мастер-класс от шеф-повара и в другой получим мастер-класс по сыру уже на сыроварне.<br> 
        Вечер проведем в городе тамплиеров в Труа.<br> 
        Вот и прошло три дня насыщенной винно-гастрономической программы.<br> 
        Дорога в аэропорт и покупка вина для личного погреба.<br> 
        Программа расчитывается индивидуально по вашим датам и вашим критериям хорошего отдыха `,
    },
    {
        id: 8,
        img: "../src/card-8.jpeg",
        title: "Путешествие в регион Долина Роны",
        place: "Лион → Вьенн → Турнон-Сюр-Рон → Лион",
        time: "5-8 часов",
        price: 40,
        slider: ['../src/8slider-1.jpeg', '../src/8slider-2.jpeg', '../src/8slider-3.jpeg', ],
        body: `Тур может начаться и закончиться в Лионе.<br> 
        Богатый винный край привлекает туристов своим живописным видом в долине реки, а также тех, кто интересуется вином.<br> <br> 
        Элегантные и насыщенные вина столь же прекрасны, как и пейзаж, где они рождаются.<br> <br> 
        Винные дегустации в престижных поместьях региона Долина Роны, остановка в городе Турнон для визита с экскурсией, подъём на холм Эрмитаж, окончание программы — с посещением шоколадной фабрики и сыроварни.<br> <br> 
        Визиты в престижные винные дома, посещение места производства, спуск в погреб, личное знакомство с виноделом и дегустация его вин с его же личным участием. Стоимость таких дегустаций — от 10 до 50 евро за 1 человека в зависимости от категории и количества вин.<br> <br> 
        Продолжительность одной дегустации от часа до двух, ваши вопросы и интерес к вину и к виноделу станут основой для определения проведенного времени в одном или нескольких винных домах. На ваш заказ резервируется предварительно время в винном поместье, которое с удовольствием предоставит имеющиеся миллезимы для дегустаций и для знакомства с данным домом.<br> <br> 
        Долина Роны — край виноградников и фруктовых садов. Пейзаж уникальный даже для такой винной страны, как Франция. Виноград растет на террасах, здесь их называют «бельведерами», извивающихся и карабкающихся по склонам холмов.<br> <br> 
        Вина из Долины Роны стали любимцами винных критиков в последние десятилетия, между тем винная культура пришла в регион еще до римлян, которые развили ее до совершенства.<br> <br> 
        Крутые берега реки вынуждают высаживать виноград, как зрителей в римском амфитеатре. Поэтажно карабкаясь ряд за рядом, растет легендарный сорт сира и вьонье. Вы можете встретить вина из них и в других региона мира, местные же признаны эталонами.<br> <br> 
        Элитный винный регион Северная Рона привлекает любителей и знатоков вина и тех, кто не безразличен к красоте щедрой природы.`,
    },
    {
        id: 9,
        img: "../src/card-9.jpeg",
        title: "Бон — винная столица Бургундии",
        place: "Бон – Франция",
        time: "4 часа",
        price: 50,
        slider: ['../src/9slider-1.jpeg', '../src/9slider-2.jpeg', '../src/9slider-3.jpeg', ],
        body: `Бон — столица вина.<br> <br> 
        Прогулка по городу. Бургундский провинциальный городок ставший самым туристическим местом в Бургундии, он же столица бургундских вин. Пройдемся по самым красивым улочкам средневекового города и посетим достойнешие вашего внимания достопримечательности. Бон редкий экземпляр средневековой застройки, крепостные стены в два ряда и сохранившиеся здания с уникальными декоративными отделками.<br> <br> 
        Дворец для Бедняков. Редкий экземпляр в Европе архитектурного стиля 15 века с цветной черепицей, весь архитектурный ансамблю удивительной красоты и гармонии насыщен историей и предметами прошедших эпох. Выстроенный после столетней войны и вспышек эпидемии «чёрной чумы», здания сохранили свой первоначальный облик. Ныне здесь музей с экспонатами различных тематических профилей.<br> <br> 
        В центре города несколько винных домов с роскошными погребами для визита и дегустаий вин. Великие вина Бургундии не оставляют равнодушными, знакомство с регионом через вкус лгендарных крю.<br> <br> 
        Музей вина в Боне.<br>
        Очаровательный музей, посвященный винной теме. Из зала в зал вы знакомитесь с винным производством и историей винного этикета.<br> <br> 
        Собор Девы Марии — редкий экземляр внутренного убранства церкви. `,
    },
    {
        id: 10,
        img: "../src/card-10.jpeg",
        title: "Винно-гастрономический тур Долина Луары",
        place: "Бурж → Тур → Бурж",
        time: "1-4 дня",
        price: 40,
        slider: ['../src/10slider-1.jpeg', '../src/10slider-2.jpeg', '../src/10slider-3.jpeg', ],
        body: `Винно-Гастрономический туризм в сочетании с классическими экскурсиями по региону Долина Луары.<br> <br> 
        Среди всех известных вин этого немаленького винного края, два марочных вина составляют визитную карточку французских вин Sancerre и Pouilly-Fumé. Элегантные и легкие вина завоевали сердца знатоков и любителей французской гастрономии наряду с козьими сырами, которые производятся здесь же по соседству с вином.<br> <br> 
        Для полного погружения винно-сырную тематику для начала приглашаю в Сансер и затем в Бурж и Тур.<br> <br> 
        Дегустации вин в винных поместьях после посещения винодельни и дегустация сыров прямо на козьей ферме в компании добродушного фермера. Щедрый край вина и лакомств ждёт своих любителей вкусно отдохнуть.<br> <br> 
        Для понимания цен дегустаций в семейных поместьях 25 евро за каждого дегустирующего после визита погребов и производства. На сырных фермах с визитом за дегустацию 15 евро за каждого.<br> <br> 
        Предложение для экскурсий в городе Сансер, пешеходная прогулка по городу с визитом музея вина.<br> <br> 
        В городе Бурж экскурсия в готическом храме. Два города расположены в часе езды друг от друга, что позволяет посетить их оба за 1 день.<br> <br> 
        В том случае, если вы выбираете дневной тур, за этот 1 день вы увидите пару винных домов, в каждом от 3 до 7 вин на пробу и экскурсия по маршруту.<br> <br> 
        По времени на визит с дегустацией уходит 1,5 ч в спокойном ритме, затем дорога до следующего дома, обед в винном доме или в ресторане с шикарным погребом, для завершения программы — прогулка или экскурсия.<br> <br> 
        Начало около 9 ч утра с учетом передвижений от отеля до первого визита и дальше мы вместе по программе до 19ч.`,
    },
    {
        id: 11,
        img: "../src/card-11.jpeg",
        title: "Винно-гастрономическое путешествие по волшебной Бургундии",
        place: "Бон → Мёрсо → Поммар → Дижон → Макон → Бон",
        time: "7 часов",
        price: 50,
        slider: ['../src/11slider-1.jpeg', '../src/11slider-2.jpeg', '../src/11slider-3.jpeg', ],
        body: `Знакомство с регионом Бургундия за 1 день.<br> <br>
        Маршрут по Бургундии включает визиты в престижные винные дома, посещение места производства, спуск в погреба, личное знакомство с виноделом и, безусловно, дегустация его вин с его же личным участием. Стоимость таких дегустаций — от 10 до 30 EUR за 1 человека в зависимости от категории и количества вин, цена включает посещение поместья.<br> <br> 
        Познавательная прогулка в сопровождении сомелье среди виноградников с комментариями об особенностях бургундских терруаров, классификации земель и вин, монашеского и буржуазного прошлого в традиционном виноделии.<br> <br> 
        В Бургундии есть предложения пообедать у винодела с его винами. В зависимости от категории вин и их количества цена, варьируется от 45 до 99 евро.<br> <br> 
        Также визит сыроварни с обзором процесса приготовления сыра и все объяснения по сырам с дегустацией сыров. За каждого дегустирующего 5 евро за 5 сортов на пробу и бокал бургундского вина.<br> <br> 
        Очередность визитов и часовая программа выстраивается индивидуально по вашим датам, с учетом ваших пожеланий.<br> <br> 
        Однодневынй тур включает визит двух поместий, в каждом от 3 до 7 вин на пробу и экскурсия по маршруту. Если вас интересует большое количество визитов, вы можете заказать несколько дней для проработки маршрута и резервации дегустация.<br> <br> 
        По времени на визит с дегустацией уходит 1,5 ч в спокойном ритме, затем дорога до следующего дома, обед в винном доме или в ресторане с шикарным погребом, для завершения программы — прогулка или экскурсия. Визиты, дегустации и рестораны желательно бронировать заранее.<br> <br> 
        знакомство с трюфелем. Среда его обитания, способы добывания и приготовления станут для вас развлекательным рассказом от профессионала своего дела на семейной ферме в пристройке старинного замка. После охоты на трюфель организуется дегустация или обед здесь же у щедрого фермера.<br> <br> 
        Для разнообразия с дегустациями в погребах виноделов могу предложить вам пойти в гости к виноделу на обед, где к каждому блюду подобран подходящий сорт вина. Гастрономические открытия и практика по сочетаемости вина и еды.<br> <br> 
        В зависимости от категории вин и их количества цена за такой обед варьируется от 39 до 99 EUR.<br> <br> 
        Начало программы около 9 ч утра с учетом передвижений от отеля до первого визита и дальше мы вместе по программе до 19ч.<br> <br> 
        Напишите, какие винные дома вы бы хотели посетить и названия вин, которые вам хотелось бы попробовать, это будет учитано при составлении программы.`,
    },
    {
        id: 12,
        img: "../src/card-12.jpeg",
        title: "Лион сквозь века",
        place: "Лион – Франция",
        time: "4-7 часов",
        price: 50,
        slider: ['../src/12slider-1.jpeg', '../src/12slider-2.jpeg', '../src/12slider-3.jpeg', ],
        body: `Город раскинулся в долинах двух рек и на двух холмах. На один из них мы с вами поднимемся для визита базилики и панорамного вида на город. Античные руины амфитеатров расположены рядом, поэтому пешком мы пройдем сквозь трибуны и далее спуск вниз к реке, где расположена старая часть города. Прогулка длится от 4 до 7 часов в зависимости от ритма движения.<br> <br> 

        Авторская экскурсия о Лионе осветит наиболее яркие моменты истории города и Франции. Проведите прямую линию на карте Европы от Рима к Лондону и посередине вы найдете Лион. Поэтому здесь можно встретить отголоски финансовой мощи первого и религиозные отголоски второго. Город полон противоречий и одновременно гармоничен.<br> <br> 
        
        Центр мистики и легенд, одновременно новшеств и традиций.<br> <br> 
        
        Алхимики и писатели наравне с шарлатанами останавливались в этом городе, и на его счастье или на беду, не оставались надолго.<br> <br> 
        
        Нострадамус и Калиостро оставили здесь своих последователей, так же, как Казанова и Мольер. Один из известных магов всё-таки прижился, знахарь Филипп, Он держал свой лечебный центр, где практиковал далеко нетрадиционную медицину. Был приглашен к русскому двору и применял свои методы для лечения цесаревича Алексея. За свою работу получил статус доктора от самого царя, а от Распутина обратный билет в Лион.<br> <br> 
        
        По соседству в центре старого Лиона, в полной секретности и скрытности от чужих глаз, проходили сеансы спиритизма. Они нашумели в начале 20 века по всему миру, и только благодаря одному лионцу приобрели систематизированную структуру после издательства его книг. Хотя для некоторых из нас астрономия, алхимия, мистицизм и спиритизм всего лишь развлечение, есть те, кто увлекается посерьёзней, как некогда ученые, прибывавшие в Лион для того, чтобы напечатать здесь свои труды. 
        Для тех кому сегодня все-таки любопытно узнать побольше, прогуливаясь по старинным улочкам, есть смысл побывать в Лионе. В центре города сохранился архитектурный ансамбль эпохи Ренессанс, размером в три городских квартала. Поэтому ваш визит может затянутся на день, а то и два.<br> <br> 
        
        Добавим, что уже сотню лет Лион признан гастрономической столицей мира, так что для гурманов поездка в Лион — цель паломнического пути.<br> <br> 
        
        Еще один вариант дороги пиллигримов — это «путь по святым местам с поклонением Деве Марии». Как раз об ее культе в стране, и в частности, в Лионе, также раскрывается много нового и интересного с посещением богатой базилики на холме Фурвьер. Лион настолько самобытный город, что при любой погоде и в любой сезон он удивит вас своим скрывающимся очарованием, схожим со сквозняком в его секретным улицах под названием «трабули».`,
    },

]


// Cards info 


tours.forEach(tour => {
	let card = document.querySelector('.cards')
  
    if (tour.id && tour.img && tour.title) {
        card.innerHTML += `
        <a class="cards__block" id="${tour.id}">
            <div class="cards__img">
                <img src="${tour.img}" alt="Фото с экскурсии" />
            </div>
            <h3 class="cards__title">${tour.title}</h3>
            <p class="cards__place">${tour.place}</p>
            <p class="cards__time">${tour.time}</p>
            <p class="cards__price">от ${tour.price}€ с группы за 1 час</p> 
        </a>
`
    }
})


document.querySelector('.cards').addEventListener('click', (e) => {
    let link = e.target.closest('a');
    if (!link) return; 

    document.querySelector('.tour__modal').classList.add('visible');

    let i = link.id-1;
    if (tours[i].title) {document.querySelector('.tour__title').innerHTML = tours[i].title;}
    if (tours[i].time) {document.querySelector('.tour__time').innerHTML = tours[i].time;}
    if (tours[i].price) {document.querySelector('.tour__price').innerHTML = `от ${tours[i].price}€ с группы за 1 час`;}
    if (tours[i].body) {document.querySelector('.tour__body').innerHTML = tours[i].body;}

    if (!document.querySelector('.tour__img')) {
        if (tours[i].slider) {
            tours[i].slider.forEach(img => {
                let photos = document.querySelector('.tour__imgs');
        
                photos.innerHTML += `
                <div class='tour__img'><img src='${img}' alt='Фото с экскурсии'></div>`
            })
        }
    }
});

document.querySelector('.modal__close').addEventListener('click', () => {
    document.querySelector('.tour__modal').classList.remove('visible');
    document.querySelector('.tour__imgs').innerHTML = '';
})
